# Lab 3: Data Preparation

#### CPE232 Data Models

---

For this lab, we will learn how to perform data preparation for data analysis after receiving the raw data from the data source.

<img src="https://github.com/cat-milk/Anime-Girls-Holding-Programming-Books/blob/master/Python/Anya_with_python_book.png?raw=true">

# [1] Reviews on Pandas

1.1) Discover

- methods to explore and understand your DataFrame

In [1]:
import pandas as pd

df = pd.read_csv("nss15.csv")
df.head()

,caseNumber,treatmentDate,statWeight,stratum,age,sex,race,diagnosis,bodyPart,disposition,location,product
0,150733174,7/11/2015,15.7762,V,5,Male,NaN,57,33,1,9,1267
1,150734723,7/6/2015,83.2157,S,36,Male,White,57,34,1,1,1439
2,150817487,8/2/2015,74.8813,L,20,Female,NaN,71,94,1,0,3274
3,150717776,6/26/2015,15.7762,V,61,Male,NaN,71,35,1,0,611
4,150721694,7/4/2015,74.8813,L,88,Female,Other,62,75,1,0,1893

In [2]:
# see the shape of the dataframe
print(df.shape)

(334839, 12)

In [3]:
# seeing the summary of the dataframe
print(df.info())

<class 'pandas.DataFrame'>
RangeIndex: 334839 entries, 0 to 334838
Data columns (total 12 columns):
 #   Column         Non-Null Count   Dtype
---  ------         --------------   -----
 0   caseNumber     334839 non-null  int64
 1   treatmentDate  334839 non-null  str
 2   statWeight     334839 non-null  float64
 3   stratum        334839 non-null  str
 4   age            334839 non-null  int64
 5   sex            334837 non-null  str
 6   race           205014 non-null  str
 7   diagnosis      334839 non-null  int64
 8   bodyPart       334839 non-null  int64
 9   disposition    334839 non-null  int64
 10  location       334839 non-null  int64
 11  product        334839 non-null  int64
dtypes: float64(1), int64(7), str(4)
memory usage: 30.7 MB
None

In [4]:
# seeing the stats of the column in dataframe
df.describe()

,caseNumber,statWeight,age,diagnosis,bodyPart,disposition,location,product
count,3.348390e+05,334839.000000,334839.000000,334839.000000,334839.000000,334839.000000,334839.000000,334839.000000
mean,1.510271e+08,39.343028,31.385451,60.154591,64.374192,1.307930,2.485451,2098.900854
std,1.720330e+06,34.142933,26.105098,6.170699,24.002331,0.977627,3.217617,1332.222670
min,1.501032e+08,4.965500,0.000000,41.000000,0.000000,1.000000,0.000000,106.000000
25%,1.504405e+08,15.059100,10.000000,57.000000,35.000000,1.000000,0.000000,1211.000000
50%,1.507358e+08,15.776200,23.000000,59.000000,75.000000,1.000000,1.000000,1807.000000
75%,1.510231e+08,74.881300,51.000000,64.000000,82.000000,1.000000,5.000000,3265.000000
max,1.603418e+08,97.923900,107.000000,74.000000,94.000000,9.000000,9.000000,5555.000000

1.2) Selecting variables

- select specific columns from the DataFrame to create a new DataFrame with only those columns

In [4]:
# select columns based on the data type
df.select_dtypes(include=["number"])

,caseNumber,statWeight,age,diagnosis,bodyPart,disposition,location,product
0,150733174,15.7762,5,57,33,1,9,1267
1,150734723,83.2157,36,57,34,1,1,1439
2,150817487,74.8813,20,71,94,1,0,3274
3,150717776,15.7762,61,71,35,1,0,611
4,150721694,74.8813,88,62,75,1,0,1893
...,...,...,...,...,...,...,...,...
334834,150739278,15.0591,7,59,76,1,1,1864
334835,150733393,5.6748,3,68,85,1,0,1931
334836,150819286,15.7762,38,71,79,1,0,3250
334837,150823002,97.9239,38,59,82,1,1,464
334838,150723074,49.2646,5,57,34,1,9,3273

In [5]:
# select column by .loc
df.loc[:6, "treatmentDate":"diagnosis"]

  treatmentDate  statWeight stratum  age     sex   race  diagnosis
0     7/11/2015     15.7762       V    5    Male    NaN         57
1      7/6/2015     83.2157       S   36    Male  White         57
2      8/2/2015     74.8813       L   20  Female    NaN         71
3     6/26/2015     15.7762       V   61    Male    NaN         71
4      7/4/2015     74.8813       L   88  Female  Other         62
5      7/2/2015      5.6748       C    1  Female  White         71
6      6/8/2015     15.7762       V   25    Male  Black         51

In [6]:
# select row by .iloc
df.iloc[0:5]

,caseNumber,treatmentDate,statWeight,stratum,age,sex,race,diagnosis,bodyPart,disposition,location,product
0,150733174,7/11/2015,15.7762,V,5,Male,NaN,57,33,1,9,1267
1,150734723,7/6/2015,83.2157,S,36,Male,White,57,34,1,1,1439
2,150817487,8/2/2015,74.8813,L,20,Female,NaN,71,94,1,0,3274
3,150717776,6/26/2015,15.7762,V,61,Male,NaN,71,35,1,0,611
4,150721694,7/4/2015,74.8813,L,88,Female,Other,62,75,1,0,1893

1.3) Filtering the data

In [7]:
# filter rows based on the condition
df[df["age"] > 50]

,caseNumber,treatmentDate,statWeight,stratum,age,sex,race,diagnosis,bodyPart,disposition,location,product
3,150717776,6/26/2015,15.7762,V,61,Male,NaN,71,35,1,0,611
4,150721694,7/4/2015,74.8813,L,88,Female,Other,62,75,1,0,1893
7,150704114,6/14/2015,83.2157,S,53,Male,White,57,30,1,0,5040
8,150736558,7/16/2015,83.2157,S,98,Male,Black,59,76,1,1,1807
16,150901411,8/27/2015,83.2157,S,65,Female,White,59,83,1,1,1817
...,...,...,...,...,...,...,...,...,...,...,...,...
334811,150702215,6/27/2015,15.7762,V,51,Female,NaN,53,83,1,1,1426
334815,151100368,10/28/2015,83.2157,S,85,Female,NaN,57,80,4,1,1807
334819,150528367,1/13/2015,49.2646,M,85,Female,NaN,57,79,5,1,676
334826,150648619,6/17/2015,15.7762,V,52,Female,White,64,30,1,1,1842
334829,150633526,4/4/2015,49.2646,M,51,Female,NaN,56,92,1,1,1616

In [8]:
# filter coloum based on column name
df.filter(like="age")

        age
0         5
1        36
2        20
3        61
4        88
...     ...
334834    7
334835    3
334836   38
334837   38
334838    5

[334839 rows x 1 columns]

1.4) Sorting

- Sort the DataFrame by its index based on column

In [9]:
# sort the dataframe based on column name and ascending order
df.sort_values(by="statWeight", ascending=False)

,caseNumber,treatmentDate,statWeight,stratum,age,sex,race,diagnosis,bodyPart,disposition,location,product
67072,150533084,5/15/2015,97.9239,M,89,Male,NaN,53,83,1,0,1842
313846,150521217,4/18/2015,97.9239,M,36,Female,NaN,64,79,1,0,5040
230135,150857760,8/25/2015,97.9239,M,14,Male,White,64,82,1,8,1807
141323,151039262,10/11/2015,97.9239,M,39,Female,White,71,35,1,1,1615
230141,150662453,6/5/2015,97.9239,M,11,Female,White,59,88,1,4,3297
...,...,...,...,...,...,...,...,...,...,...,...,...
122009,151146792,11/15/2015,4.9655,C,2,Female,White,59,76,1,0,1893
211090,151253201,12/15/2015,4.9655,C,2,Male,White,60,88,1,1,661
317625,160106638,12/25/2015,4.9655,C,1,Male,White,55,32,1,1,679
33679,151256307,12/20/2015,4.9655,C,9,Female,Black,57,83,1,0,1842
229596,160148171,12/4/2015,4.9655,C,16,Female,Other,55,35,1,0,1267

In [10]:
# sort the index of the dataframe
df.sort_index()

,caseNumber,treatmentDate,statWeight,stratum,age,sex,race,diagnosis,bodyPart,disposition,location,product
0,150733174,7/11/2015,15.7762,V,5,Male,NaN,57,33,1,9,1267
1,150734723,7/6/2015,83.2157,S,36,Male,White,57,34,1,1,1439
2,150817487,8/2/2015,74.8813,L,20,Female,NaN,71,94,1,0,3274
3,150717776,6/26/2015,15.7762,V,61,Male,NaN,71,35,1,0,611
4,150721694,7/4/2015,74.8813,L,88,Female,Other,62,75,1,0,1893
...,...,...,...,...,...,...,...,...,...,...,...,...
334834,150739278,5/31/2015,15.0591,V,7,Male,NaN,59,76,1,1,1864
334835,150733393,7/11/2015,5.6748,C,3,Female,Black,68,85,1,0,1931
334836,150819286,7/24/2015,15.7762,V,38,Male,NaN,71,79,1,0,3250
334837,150823002,8/8/2015,97.9239,M,38,Female,White,59,82,1,1,464
334838,150723074,6/20/2015,49.2646,M,5,Female,White,57,34,1,9,3273

1.5) Add/Remove

- This section shows how to manipulate the DataFrame's structure

In [11]:
# Dropping the column
df.drop(columns=["disposition"])

,caseNumber,treatmentDate,statWeight,stratum,age,sex,race,diagnosis,bodyPart,location,product
0,150733174,7/11/2015,15.7762,V,5,Male,NaN,57,33,9,1267
1,150734723,7/6/2015,83.2157,S,36,Male,White,57,34,1,1439
2,150817487,8/2/2015,74.8813,L,20,Female,NaN,71,94,0,3274
3,150717776,6/26/2015,15.7762,V,61,Male,NaN,71,35,0,611
4,150721694,7/4/2015,74.8813,L,88,Female,Other,62,75,0,1893
...,...,...,...,...,...,...,...,...,...,...,...
334834,150739278,5/31/2015,15.0591,V,7,Male,NaN,59,76,1,1864
334835,150733393,7/11/2015,5.6748,C,3,Female,Black,68,85,0,1931
334836,150819286,7/24/2015,15.7762,V,38,Male,NaN,71,79,0,3250
334837,150823002,8/8/2015,97.9239,M,38,Female,White,59,82,1,464
334838,150723074,6/20/2015,49.2646,M,5,Female,White,57,34,9,3273

In [12]:
# Adding column and create into a new column
df.assign(new_column=df["diagnosis"] + df["bodyPart"])

,caseNumber,treatmentDate,statWeight,stratum,age,sex,race,diagnosis,bodyPart,disposition,location,product,new_column
0,150733174,7/11/2015,15.7762,V,5,Male,NaN,57,33,1,9,1267,90
1,150734723,7/6/2015,83.2157,S,36,Male,White,57,34,1,1,1439,91
2,150817487,8/2/2015,74.8813,L,20,Female,NaN,71,94,1,0,3274,165
3,150717776,6/26/2015,15.7762,V,61,Male,NaN,71,35,1,0,611,106
4,150721694,7/4/2015,74.8813,L,88,Female,Other,62,75,1,0,1893,137
...,...,...,...,...,...,...,...,...,...,...,...,...,...
334834,150739278,5/31/2015,15.0591,V,7,Male,NaN,59,76,1,1,1864,135
334835,150733393,7/11/2015,5.6748,C,3,Female,Black,68,85,1,0,1931,153
334836,150819286,7/24/2015,15.7762,V,38,Male,NaN,71,79,1,0,3250,150
334837,150823002,8/8/2015,97.9239,M,38,Female,White,59,82,1,1,464,141
334838,150723074,6/20/2015,49.2646,M,5,Female,White,57,34,1,9,3273,91

In [13]:
# Removing the column and assigning it to a new variable
ages = df.pop("age")

1.6) Clean missing

- to remove rows with missing values or replace missing values with a specified value

In [14]:
# replaceing the missing values with a specified value
df.fillna(value=0)

,caseNumber,treatmentDate,statWeight,stratum,sex,race,diagnosis,bodyPart,disposition,location,product
0,150733174,7/11/2015,15.7762,V,Male,0,57,33,1,9,1267
1,150734723,7/6/2015,83.2157,S,Male,White,57,34,1,1,1439
2,150817487,8/2/2015,74.8813,L,Female,0,71,94,1,0,3274
3,150717776,6/26/2015,15.7762,V,Male,0,71,35,1,0,611
4,150721694,7/4/2015,74.8813,L,Female,Other,62,75,1,0,1893
...,...,...,...,...,...,...,...,...,...,...,...
334834,150739278,5/31/2015,15.0591,V,Male,0,59,76,1,1,1864
334835,150733393,7/11/2015,5.6748,C,Female,Black,68,85,1,0,1931
334836,150819286,7/24/2015,15.7762,V,Male,0,71,79,1,0,3250
334837,150823002,8/8/2015,97.9239,M,Female,White,59,82,1,1,464
334838,150723074,6/20/2015,49.2646,M,Female,White,57,34,1,9,3273

In [15]:
# Remove the rows with missing values
df.dropna()

,caseNumber,treatmentDate,statWeight,stratum,sex,race,diagnosis,bodyPart,disposition,location,product
1,150734723,7/6/2015,83.2157,S,Male,White,57,34,1,1,1439
4,150721694,7/4/2015,74.8813,L,Female,Other,62,75,1,0,1893
5,150721815,7/2/2015,5.6748,C,Female,White,71,76,1,1,1715
6,150713483,6/8/2015,15.7762,V,Male,Black,51,33,4,9,1138
7,150704114,6/14/2015,83.2157,S,Male,White,57,30,1,0,5040
...,...,...,...,...,...,...,...,...,...,...,...
334830,150628863,6/8/2015,15.7762,V,Female,White,64,79,1,1,1522
334831,150607637,5/22/2015,5.6748,C,Female,Black,59,94,1,0,1616
334835,150733393,7/11/2015,5.6748,C,Female,Black,68,85,1,0,1931
334837,150823002,8/8/2015,97.9239,M,Female,White,59,82,1,1,464
334838,150723074,6/20/2015,49.2646,M,Female,White,57,34,1,9,3273

---

# [2] Data Cleaning and Preparation

### .isnull, .dropna, .fillna

2.1) checking

In [16]:
df.columns

Index(['caseNumber', 'treatmentDate', 'statWeight', 'stratum', 'sex', 'race',
       'diagnosis', 'bodyPart', 'disposition', 'location', 'product'],
      dtype='str')

In [17]:
# isnull checking
df.isnull().sum()

caseNumber            0
treatmentDate         0
statWeight            0
stratum               0
sex                   2
race             129825
diagnosis             0
bodyPart              0
disposition           0
location              0
product               0
dtype: int64

In [18]:
# percentage of missing values for the race
df.race.isnull().sum() / df.shape[0] * 100

np.float64(38.772365226272925)

In [19]:
df.shape[0]

334839

2.2) Drop column

In [20]:
# remove column by using
df = df.drop(columns=["race"])

In [21]:
df.head()

,caseNumber,treatmentDate,statWeight,stratum,sex,diagnosis,bodyPart,disposition,location,product
0,150733174,7/11/2015,15.7762,V,Male,57,33,1,9,1267
1,150734723,7/6/2015,83.2157,S,Male,57,34,1,1,1439
2,150817487,8/2/2015,74.8813,L,Female,71,94,1,0,3274
3,150717776,6/26/2015,15.7762,V,Male,71,35,1,0,611
4,150721694,7/4/2015,74.8813,L,Female,62,75,1,0,1893

2.3) Data imputation

In [23]:
# fillna
df["age"] = df["age"].fillna(df["age"].median())

KeyError: 'age'

**Q1 – Why does it show an error?**

Ans: We ran `df.pop("age")` earlier, so the `age` column was removed from `df` and stored in `ages`. When we do `df["age"].fillna(...)`, the column no longer exists, so we get a KeyError.

**Q2 – Fix the error from Q1.**

In [24]:
# [Q2] Put the column back first, then fillna
df["age"] = ages

# fillna again
df["age"] = df["age"].fillna(df["age"].median())

df.head()

,caseNumber,treatmentDate,statWeight,stratum,sex,diagnosis,bodyPart,disposition,location,product,age
0,150733174,7/11/2015,15.7762,V,Male,57,33,1,9,1267,5
1,150734723,7/6/2015,83.2157,S,Male,57,34,1,1,1439,36
2,150817487,8/2/2015,74.8813,L,Female,71,94,1,0,3274,20
3,150717776,6/26/2015,15.7762,V,Male,71,35,1,0,611,61
4,150721694,7/4/2015,74.8813,L,Female,62,75,1,0,1893,88

2.4) Drop row that have missing value

In [25]:
# remove column by using .dropna()
df = df.dropna()

In [26]:
df.isnull().sum()

caseNumber       0
treatmentDate    0
statWeight       0
stratum          0
sex              0
diagnosis        0
bodyPart         0
disposition      0
location         0
product          0
age              0
dtype: int64

### Datetime

2.5) Working with the datetime format

In [27]:
df["treatmentDate"] = pd.to_datetime(df["treatmentDate"], format="%m/%d/%Y")

In [28]:
df.info()

<class 'pandas.DataFrame'>
Index: 334837 entries, 0 to 334838
Data columns (total 11 columns):
 #   Column         Non-Null Count   Dtype
---  ------         --------------   -----
 0   caseNumber     334837 non-null  int64
 1   treatmentDate  334837 non-null  datetime64[us]
 2   statWeight     334837 non-null  float64
 3   stratum        334837 non-null  str
 4   sex            334837 non-null  str
 5   diagnosis      334837 non-null  int64
 6   bodyPart       334837 non-null  int64
 7   disposition    334837 non-null  int64
 8   location       334837 non-null  int64
 9   product        334837 non-null  int64
 10  age            334837 non-null  int64
dtypes: datetime64[us](1), float64(1), int64(7), str(2)
memory usage: 30.7 MB

In [29]:
df["Year"] = df["treatmentDate"].dt.year

In [30]:
df["Month"] = df["treatmentDate"].dt.month

In [31]:
df.head()

,caseNumber,treatmentDate,statWeight,stratum,sex,diagnosis,bodyPart,disposition,location,product,age,Year,Month
0,150733174,2015-07-11,15.7762,V,Male,57,33,1,9,1267,5,2015,7
1,150734723,2015-07-06,83.2157,S,Male,57,34,1,1,1439,36,2015,7
2,150817487,2015-08-02,74.8813,L,Female,71,94,1,0,3274,20,2015,8
3,150717776,2015-06-26,15.7762,V,Male,71,35,1,0,611,61,2015,6
4,150721694,2015-07-04,74.8813,L,Female,62,75,1,0,1893,88,2015,7

**Q3 – Change the date format to DD/MM/YYYY. Show your work.**

In [32]:
df["Date_DDMMYYYY"] = df["treatmentDate"].dt.strftime("%d/%m/%Y")
df[["treatmentDate", "Date_DDMMYYYY"]].head()

  treatmentDate Date_DDMMYYYY
0    2015-07-11    11/07/2015
1    2015-07-06    06/07/2015
2    2015-08-02    02/08/2015
3    2015-06-26    26/06/2015
4    2015-07-04    04/07/2015

### Combine Dataframe by .merge and .concat

2.6 Merge

In [33]:
import pandas as pd

superstore_order = pd.read_csv("Superstore/superstore_order.csv")
superstore_people = pd.read_csv("Superstore/superstore_people.csv")
superstore_return = pd.read_csv("Superstore/superstore_return.csv")

In [34]:
superstore_order.merge(
    superstore_return[superstore_return["Returned"] == "Yes"], on="Order ID", how="inner"
)[["Customer ID", "Returned"]].drop_duplicates()

    Customer ID Returned
0      ZD-21925      Yes
3      TB-21055      Yes
10     JS-15685      Yes
13     LC-16885      Yes
20     BS-11755      Yes
..          ...      ...
688    ED-13885      Yes
689    TS-21205      Yes
696    MF-17665      Yes
702    SH-19975      Yes
705    RB-19435      Yes

[222 rows x 2 columns]

**Q4 – What does `how="inner"` do?**

Ans: It keeps only rows where the same Order ID appears in both tables. So we only see orders that were returned.

**Q5 – What does the result above tell you?**

Ans: It is the list of customers (Customer IDs) who had at least one order returned.

2.7) Concatenate

In [35]:
pd.concat([superstore_order, superstore_people], axis=1, join="inner")

,Row ID,Order ID,Order Date,Ship Date,Ship Mode,Customer ID,Customer Name,Segment,Country,City,...,Product ID,Category,Sub-Category,Product Name,Sales,Quantity,Discount,Profit,Person,Region
0,1,CA-2016-152156,08/11/2016,11/11/2016,Second Class,CG-12520,Claire Gute,Consumer,United States,Henderson,...,FUR-BO-10001798,Furniture,Bookcases,Bush Somerset Collection Bookcase,261.9600,2,0.00,41.9136,Anna Andreadi,West
1,2,CA-2016-152156,08/11/2016,11/11/2016,Second Class,CG-12520,Claire Gute,Consumer,United States,Henderson,...,FUR-CH-10000454,Furniture,Chairs,Hon Deluxe Fabric Upholstered Stacking Chairs ...,731.9400,3,0.00,219.5820,Chuck Magee,East
2,3,CA-2016-138688,12/06/2016,16/06/2016,Second Class,DV-13045,Darrin Van Huff,Corporate,United States,Los Angeles,...,OFF-LA-10000240,Office Supplies,Labels,Self-Adhesive Address Labels for Typewriters b...,14.6200,2,0.00,6.8714,Kelly Williams,Central
3,4,US-2015-108966,11/10/2015,18/10/2015,Standard Class,SO-20335,Sean ODonnell,Consumer,United States,Fort Lauderdale,...,FUR-TA-10000577,Furniture,Tables,Bretford CR4500 Series Slim Rectangular Table,957.5775,5,0.45,-383.0310,Cassandra Brandow,South

**Q6 – What is the difference between `inner` and `outer` in `pd.concat`'s `join`?**

Ans: Inner keeps only columns that exist in all DataFrames. Outer keeps all columns from every DataFrame and fills missing with NaN.

**Q7 – Append a new row to superstore_order. Set Row ID to your student ID and fill other fields like existing rows.**

In [36]:
new_row = superstore_order.iloc[0].copy()
new_row["Row ID"] = 99999
new_row["Order ID"] = "XX-9999-99999"
superstore_order = pd.concat([superstore_order, new_row.to_frame().T], ignore_index=True)
superstore_order.tail(2)

,Row ID,Order ID,Order Date,Ship Date,Ship Mode,Customer ID,Customer Name,Segment,Country,City,...,Postal Code,Region,Product ID,Category,Sub-Category,Product Name,Sales,Quantity,Discount,Profit
8879,8880,US-2015-107944,23/03/2015,25/03/2015,First Class,AM-10360,Alice McCarthy,Corporate,United States,Los Angeles,...,90008,West,OFF-PA-10000659,Office Supplies,Paper,TOPS Carbonless Receipt Book Four 2-3/4 x 7-1/...,192.72,11,0.0,92.5056
8880,99999,XX-9999-99999,08/11/2016,11/11/2016,Second Class,CG-12520,Claire Gute,Consumer,United States,Henderson,...,42420,South,FUR-BO-10001798,Furniture,Bookcases,Bush Somerset Collection Bookcase,261.96,2,0.0,41.9136

### Groupby

In [37]:
superstore_order["Profit Ratio"] = superstore_order["Profit"] / superstore_order["Sales"]

superstore_order.groupby(["Category", "Sub-Category"]).agg(
    mean_profit_ratio=("Profit Ratio", "mean")
)

                             mean_profit_ratio
Category        Sub-Category
Furniture       Bookcases            -0.126346
                Chairs                0.045028
                Furnishings           0.140782
                Tables               -0.147916
Office Supplies Appliances           -0.145513
                Art                   0.251678
                Binders              -0.191641
                Envelopes             0.421913
                Fasteners             0.301157
                Labels                0.429984
                Paper                 0.425586
                Storage               0.092382
                Supplies               0.10497
Technology      Accessories           0.219012
                Copiers               0.317826
                Machines             -0.059535
                Phones                0.118926

**Q8 – What does the result above tell you?**

Ans: It shows the average profit ratio (Profit/Sales) for each Category and Sub-Category.

### Pivot and Melt

Pivot

In [38]:
superstore_order.pivot_table(
    index="State", columns="Ship Mode", values="Order ID", aggfunc="count"
).fillna(0).head(10)

Ship Mode             First Class  Same Day  Second Class  Standard Class
State
Alabama                       9.0       1.0          18.0            30.0
Arizona                      42.0      15.0          22.0           123.0
Arkansas                     10.0       2.0           8.0            35.0
California                  302.0     106.0         346.0          1000.0
Colorado                     43.0       5.0          32.0            95.0
Connecticut                  19.0       8.0          11.0            39.0
Delaware                     16.0       2.0          13.0            55.0
District of Columbia          0.0       0.0           3.0             7.0
Florida                      47.0      25.0          57.0           210.0
Georgia                      19.0      15.0          31.0           108.0

In [39]:
pivot_table_result = superstore_order.pivot_table(
    index="State", columns="Ship Mode", values="Order ID", aggfunc="count"
).fillna(0)
print(pivot_table_result)

Ship Mode             First Class  Same Day  Second Class  Standard Class
State
Alabama                       9.0       1.0          18.0            30.0
Arizona                      42.0      15.0          22.0           123.0
Arkansas                     10.0       2.0           8.0            35.0
California                  302.0     106.0         346.0          1000.0
Colorado                     43.0       5.0          32.0            95.0
Connecticut                  19.0       8.0          11.0            39.0
Delaware                     16.0       2.0          13.0            55.0
District of Columbia          0.0       0.0           3.0             7.0
Florida                      47.0      25.0          57.0           210.0
Georgia                      19.0      15.0          31.0           108.0
Idaho                         3.0       0.0           2.0            13.0
Illinois                     58.0      24.0          96.0           249.0
Indiana                      13.0       3.0          30.0            79.0
Iowa                          1.0       1.0           4.0            17.0
Kansas                        6.0       1.0           2.0            15.0
Kentucky                     12.0       5.0          50.0            62.0
Louisiana                     7.0       2.0          14.0            15.0
Maine                         0.0       0.0           0.0             5.0
Maryland                     18.0       7.0          12.0            63.0
Massachusetts                14.0       4.0          35.0            71.0
Michigan                     20.0      16.0          43.0           151.0
Minnesota                     9.0       4.0          13.0            59.0
Mississippi                   3.0       4.0           7.0            36.0
Missouri                      7.0       2.0          20.0            24.0
Montana                       1.0       1.0           0.0            13.0
Nebraska                      6.0       3.0           6.0            20.0
Nevada                        4.0       1.0          12.0            17.0
New Hampshire                 2.0       0.0          10.0            13.0
New Jersey                    5.0       1.0          20.0            87.0
New Mexico                    1.0       0.0           9.0            22.0
New York                    155.0      57.0         183.0           606.0
North Carolina               36.0      14.0          40.0           139.0
North Dakota                  0.0       0.0           5.0             2.0
Ohio                         66.0      47.0          84.0           199.0
Oklahoma                      5.0       6.0           7.0            44.0
Oregon                       20.0       0.0          15.0            81.0
Pennsylvania                103.0       9.0          78.0           341.0
Rhode Island                 16.0       0.0          21.0            16.0
South Carolina                3.0       5.0          18.0            16.0
South Dakota                  2.0       0.0           0.0             9.0
Tennessee                    21.0       2.0          24.0           118.0
Texas                       125.0      37.0         161.0           537.0
Utah                          4.0       2.0          19.0            28.0
Vermont                       0.0       0.0           1.0             2.0
Virginia                     39.0       4.0          33.0           115.0
Washington                   56.0      34.0          97.0           265.0
West Virginia                 0.0       0.0           0.0             3.0
Wisconsin                    12.0       3.0          10.0            66.0
Wyoming                       0.0       0.0           0.0             1.0

Melt

In [40]:
melted_result = pd.melt(
    pivot_table_result.reset_index(),
    id_vars=["State"],
    var_name="Ship Mode",
    value_name="Order Count",
)
print(melted_result)

             State       Ship Mode  Order Count
0          Alabama     First Class          9.0
1          Arizona     First Class         42.0
2         Arkansas     First Class         10.0
3       California     First Class        302.0
4         Colorado     First Class         43.0
..             ...             ...          ...
191       Virginia  Standard Class        115.0
192     Washington  Standard Class        265.0
193  West Virginia  Standard Class          3.0
194      Wisconsin  Standard Class         66.0
195        Wyoming  Standard Class          1.0

[196 rows x 3 columns]

**Q9 – What is the advantage of using `melt`?**

Ans: It turns a wide table (many columns) into a long one (fewer columns, more rows), so it is easier to plot or filter by that variable.

**Q10 – From superstore_order, display ascending order of Profit grouped by Category.**

In [41]:
superstore_order.groupby("Category")["Profit"].sum().sort_values(ascending=True)

Category
Furniture           16900.4755
Office Supplies    105827.0238
Technology         133410.4932
Name: Profit, dtype: object

**Q11 – Create a column for total price (Sales \* Quantity), then group by Product ID and Category and show the mean of that total price.**

In [42]:
superstore_order["Total_Price"] = superstore_order["Sales"] * superstore_order["Quantity"]
superstore_order.groupby(["Product ID", "Category"])["Total_Price"].mean()

Product ID       Category
FUR-BO-10000112  Furniture        7426.566
FUR-BO-10000330  Furniture        1258.192
FUR-BO-10000362  Furniture        1726.898
FUR-BO-10000468  Furniture        426.5324
FUR-BO-10000711  Furniture          3194.1
                                  ...
TEC-PH-10004912  Technology         747.32
TEC-PH-10004922  Technology       673.2495
TEC-PH-10004924  Technology      57.149333
TEC-PH-10004959  Technology        412.009
TEC-PH-10004977  Technology    2441.475429
Name: Total_Price, Length: 1846, dtype: object

**Q12 – Complete the function so the `ratio` column is First Class / Standard Class on `pivot_table_result`.**

In [43]:
# function to transform the ratio
def get_class_ratio(row):
    first_class = row["First Class"]
    standard_class = row["Standard Class"]
    ratio = first_class / standard_class if standard_class != 0 else 0
    return ratio


pivot_table_result["ratio"] = pivot_table_result.apply(get_class_ratio, axis=1)

pivot_table_result.head()

Ship Mode   First Class  Same Day  Second Class  Standard Class     ratio
State
Alabama             9.0       1.0          18.0            30.0  0.300000
Arizona            42.0      15.0          22.0           123.0  0.341463
Arkansas           10.0       2.0           8.0            35.0  0.285714
California        302.0     106.0         346.0          1000.0  0.302000
Colorado           43.0       5.0          32.0            95.0  0.452632

**Q13 – What does the `apply` function do?**

Ans: It runs our function on every row (or column) and returns a new Series with the results. Here it computes the ratio for each row.

**Q14 – Create a column `short_ratio` that does the same as Q12 but with a lambda.**

In [44]:
pivot_table_result["short_ratio"] = pivot_table_result.apply(
    lambda row: row["First Class"] / row["Standard Class"] if row["Standard Class"] != 0 else 0,
    axis=1,
)

pivot_table_result.head()

Ship Mode,First Class,Same Day,Second Class,Standard Class,ratio,short_ratio
State,,,,,,
Alabama,9.0,1.0,18.0,30.0,0.300000,0.300000
Arizona,42.0,15.0,22.0,123.0,0.341463,0.341463
Arkansas,10.0,2.0,8.0,35.0,0.285714,0.285714
California,302.0,106.0,346.0,1000.0,0.302000,0.302000
Colorado,43.0,5.0,32.0,95.0,0.452632,0.452632

[Q15] What is the difference between `apply` and `lambda` function? give 2 examples use case.

**Answer:** `apply` is a **method** that applies a function along an axis (rows or columns); `lambda` is a way to define a **small anonymous function**. They are complementary: you often pass a `lambda` (or a named function) to `apply`.

**Two use cases:**

1. **Row-wise calculation with lambda:** e.g. `df.apply(lambda row: row["A"] / row["B"], axis=1)` for a quick per-row ratio.
2. **Reusable logic with a named function:** e.g. `df.apply(get_class_ratio, axis=1)` when the logic is more complex or reused (as in Q12).